tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "sass/sass"
brew "act"
brew "libpng"
brew "xz"
brew "glib"
brew "libtiff"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "asdf"
brew "at-spi2-core"
brew "bash"
brew "btop"
brew "caddy"
brew "cfitsio"
brew "cmake"
brew "crunch"
brew "libssh2"
brew "curl"
brew "deno"
brew "docutils"
brew "node"
brew "openjdk"
brew "emscripten"
brew "exiftool"
brew "fd"
brew "libidn2"
brew "unbound"
brew "openjpeg"
brew "leptonica"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "pmix"
brew "open-mpi"
brew "fftw"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "pkgconf"
brew "gobject-introspection"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "openblas"
brew "numpy"
brew "py3cairo"
brew "pygobject3"
brew "qwt-qt5"
brew "soapyrtlsdr"
brew "uhd"
brew "gnuradio"
brew "go"
brew "go@1.22"
brew "gpgme"
brew "hdf5"
brew "htop"
brew "hugo"
brew "hunspell"
brew "jasper"
brew "shared-mime-info"
brew "libheif"
brew "libomp", link: true
brew "libraw"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "lazygit"
brew "libexif"
brew "libgsf"
brew "libmatio"
brew "libproxy"
brew "media-info"
brew "ninja"
brew "meson"
brew "mkcert"
brew "neofetch"
brew "neovim"
brew "neovide", link: false
brew "nghttp2"
brew "nginx"
brew "nmap"
brew "nss"
brew "nvm"
brew "openslide"
brew "openvino"
brew "parallel"
brew "php"
brew "poppler"
brew "postgresql@17", link: true
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qt"
brew "ripgrep"
brew "ruby", link: true
brew "shellcheck"
brew "sloccount"
brew "smartmontools"
brew "sphinx-doc", link: false
brew "sqlc"
brew "tcl-tk"
brew "telnet"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "vips"
brew "wget"
brew "whois"
brew "yt-dlp"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-black-dragon-icon", "with-native-comp"]
brew "jakehilborn/jakehilborn/displayplacer"
brew "sass/sass/sass"
cask "eloston-chromium"
cask "emacs"
cask "linearmouse"
cask "macmediakeyforwarder"
cask "neovide"
cask "skim"
cask "vscodium"
vscode "actboy168.lua-debug"
vscode "alefragnani.bookmarks"
vscode "be5invis.toml"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "casualjim.gotemplate"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dcr30.lualinter"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hookyqr.minify"
vscode "idleberg.applescript"
vscode "jeff-hykin.better-cpp-syntax"
vscode "keyring.lua"
vscode "marchiore.csvtomarkdown"
vscode "matthewpi.caddyfile-support"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-pugbeautify"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "naumovs.color-highlight"
vscode "onecentlin.laravel-blade"
vscode "prisma.prisma"
vscode "stpn.vscode-graphql"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "trixnz.vscode-lua"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "zhuangtongfa.material-theme"
